# Lectures 13-15 

- extracts from lectures 13-15
- 16 will be covered in next course
- good to have some extra tools in your toolkit
- connecting duckdb to python

In [2]:
with open("sql/ingestion.sql", 'r') as sql_script:
    sql_code = sql_script.read()

sql_code

"CREATE SCHEMA IF NOT EXISTS staging;\n\nCREATE TABLE IF NOT EXISTS staging.students AS (\n\tSELECT * FROM read_csv_auto('data/students.csv')\n);\n\nCREATE TABLE IF NOT EXISTS staging.teachers AS (\n\tSELECT * FROM read_csv_auto('data/teachers.csv')\n);\n\nCREATE TABLE IF NOT EXISTS staging.housing_sales AS (\n\tSELECT * FROM read_csv_auto('data/housing_sales.csv')\n);\n\nCREATE TABLE IF NOT EXISTS staging.neighborhoods AS (\n\tSELECT * FROM read_csv_auto('data/neighborhoods.csv')\n);\n\nCREATE TABLE IF NOT EXISTS staging.categories AS (\n\tSELECT * FROM read_csv_auto('data/categories.csv')\n);\n\nCREATE TABLE IF NOT EXISTS staging.sales AS (\n\tSELECT * FROM read_csv_auto('data/sales.csv')\n);"

In [3]:
import duckdb

with duckdb.connect("data/lecture_13_15.duckdb") as conn:
    conn.execute(sql_code)
    describe = conn.execute("DESC;").df()

describe

,database,schema,name,column_names,column_types,temporary
0,lecture_13_15,staging,categories,"[category_id, category_name, parent_category_id]","[BIGINT, VARCHAR, BIGINT]",False
1,lecture_13_15,staging,housing_sales,"[sale_id, neighborhood_id, address, date_of_sa...","[VARCHAR, BIGINT, VARCHAR, DATE, VARCHAR, BIGI...",False
2,lecture_13_15,staging,neighborhoods,"[neighborhood_id, name, city, postal_code, med...","[BIGINT, VARCHAR, VARCHAR, BIGINT, BIGINT, BIG...",False
3,lecture_13_15,staging,sales,"[product_id, product_name, category_id, quanti...","[VARCHAR, VARCHAR, BIGINT, BIGINT, BIGINT]",False
4,lecture_13_15,staging,students,"[student_id, grade_math, class_name]","[VARCHAR, BIGINT, VARCHAR]",False
5,lecture_13_15,staging,teachers,"[class_name, teacher_name]","[VARCHAR, VARCHAR]",False